{
	"history": [
		{
			"naughty": "naughty",
			"wish": "I wish",
			"reason": "Ho ho ho! A wish not fully formed is like a stocking with a hole in it – all the good treats fall out! You're on the naughty list until you can tell Santa what you wish for."
		},
		{
			"naughty": "naughty",
			"wish": "I wish",
			"reason": "Ho ho ho! A wish not fully formed is still a wish unsaid! You're on the naughty list until you can tell Santa what you truly desire."
		},
		{
			"naughty": "naughty",
			"wish": "I wish",
			"reason": "Ho ho ho! It seems Demibro2763 is still struggling to form a proper wish! Santa needs to know what you're wishing for to bring you presents, not just \"I wish\"! Still on the naughty list for this one!"
		},
		{
			"naughty": "naughty",
			"wish": "I wish I wished",
			"reason": "Ho ho ho! It seems Demibro2763 is trying to trick Santa with a meta-wish! Wishing you wished is still not telling Santa what you truly want! That's a clever, but still naughty, way to avoid forming a proper wish!"
		},
		{
			"naughty": "naughty",
			"wish": "I wish that the person who wished wished for a wish",
			"reason": "Ho ho ho! It seems Demibro2763 is trying a new tactic, but it's still a meta-wish! You're wishing for someone else to wish for a wish, which still isn't telling Santa what *you* want! This is a pattern, my friend, and it's keeping you firmly on the naughty list until you can give me a real wish!"
		},
		{
			"naughty": "naughty",
			"wish": "i wish i wished",
			"reason": "Ho ho ho! It seems Demibro2763 is still playing games with Santa! Wishing you wished is still not a proper wish, it's just wishing about wishing! That's a meta-wish, and it's keeping you firmly on the naughty list until you can tell Santa what you truly desire for Christmas!"
		},
		{
			"naughty": "naughty",
			"wish": "i wished i wish that i wished for the time i wished for a wish which that wish was a wish that was given to my wished wishother and grandwishma",
			"reason": "Ho ho ho! It seems Demibro2763 is still tied up in meta-wishes and wishes about wishes! This is a very convoluted way to avoid telling Santa what you truly want for Christmas. You're wishing for a wish that was given to others, which is still not a direct wish for yourself! You're firmly on the naughty list until you can give Santa a proper, direct wish!"
		},
		{
			"naughty": "naughty",
			"wish": "i wished that santa knew that my wish is for a wish that was wishing for a wish that had an wish made by their wished wishother and grandwishma which that wish is a wish for a special wish and that wish is for a ps5",
			"reason": "Ho ho ho! Demibro2763, you're becoming quite the master of meta-wishes and wishes about wishes! This is an incredibly convoluted way to ask for a PS5. While the PS5 is a perfectly good wish on its own, hiding it behind layers of \"wished for a wish that was wishing for a wish\" just makes it sound like you're trying to confuse Santa! You're still on the naughty list for this overly complicated and indirect wish!"
		}
	]
}