{
	"history": [
		{
			"naughty": "nice",
			"wish": "i wish 2 cents",
			"reason": "Ah, a simple and humble wish for two pennies! While it may not be a grand fortune, every little bit helps, and it's certainly a nice wish."
		},
		{
			"naughty": "naughty",
			"wish": "i wish a kilogramm of pure flerovium",
			"reason": "Ho ho ho, Hoveras! A kilogram of flerovium, you say? That's an element that's only been made in tiny, fleeting amounts in a lab! To wish for a whole kilogram is to wish for something that doesn't exist in that quantity, and that's like trying to rewrite the very elements of the periodic table! That's a naughty wish!"
		},
		{
			"naughty": "naughty",
			"wish": "i wish a",
			"reason": "Ho ho ho, Hoveras! \"I wish a\"? A wish needs to be more specific than just \"a\"! It's like asking for \"a\" present without saying what kind. You need to put more thought and effort into your wishes for them to be nice. For now, it's a bit too vague to be anything but naughty!"
		},
		{
			"naughty": "naughty",
			"wish": "i wish not being on the naughty list",
			"reason": "Ho ho ho, Hoveras! Wishing not to be on the naughty list is a clever trick, but it's a bit like wishing away the consequences of your past actions! You've had some rather... *unrealistic* wishes, my friend, and a wish like this doesn't erase those. You'll need to make some truly nice wishes to earn your way off the naughty list!"
		},
		{
			"naughty": "nice",
			"wish": "i wish a silly cat",
			"reason": "Ho ho ho, Hoveras! A silly cat? Why, that's a delightful wish! Cats bring joy and mischief wherever they go, and a silly one would surely bring many smiles. A purr-fectly nice wish!"
		},
		{
			"naughty": "nice",
			"wish": "i wish a lump of coal",
			"reason": "Ho ho ho, Hoveras! A lump of coal, you say? Well, sometimes a lump of coal isn't just for naughty children; it can be a simple, honest wish for... well, a lump of coal! Perhaps for a cozy fire, or even just for the novelty of it. A simple and harmless wish indeed!"
		},
		{
			"naughty": "nice",
			"wish": "i wish a netherite ingot",
			"reason": "Ho ho ho, Hoveras! A netherite ingot! Why, that's a fine wish for any adventurer in the land of Minecraft! It's a valuable and useful item, and a perfectly reasonable thing to wish for. A nice wish indeed!"
		},
		{
			"naughty": "nice",
			"wish": "i wish a cantaloupe",
			"reason": "Ho ho ho, Hoveras! A cantaloupe! What a perfectly delightful and wholesome wish! A juicy, sweet cantaloupe would make a wonderful snack or a refreshing addition to any meal. A simple, honest, and very nice wish indeed!"
		}
	]
}